#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-4opA5Cxqp6EvcpL7

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.primary.aws_iam_role.this: Refreshing state... [id=primary-role]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
module.primary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/primary-policy]
module.primary.aws_iam_instance_profile.this: Refreshing state... [id=primary-instance-profile]
module.primary.aws_iam_role_policy_attachment.this: Refreshing state... [id=primary-role-20250511140945684000000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
module.primary.data.aws_subnet.self: Refreshing...
module.database.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.primary.aws_security_group.this: Refreshing state... [id=sg-0fdb1b9c3b039a84c]
module.primary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.database.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.primary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3791152922]
module.primary.aws_instance.this: Refreshing state... [id=i-0fe1c29e38b0002e3]
module.primary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-4230518557]
module.primary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3043918155]
module.primary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3554462896]
module.primary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-4221056507]
module.primary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-274210594]
module.primary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1236290580]
aws_security_group_rule.allow_inbound_connections_from_primary: Refreshing state... [id=sgrule-336474058]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.primary.aws_eip.this: Refreshing state... [id=eipalloc-081a96ff3bdd55368]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.records["forkup"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_forkup_A]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
module.database.aws_security_group.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.forkup_records[""] will be created
  + resource "aws_route53_record" "forkup_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
        name            = null
      + records         = [
          + "54.154.92.77",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.forkup will be created
  + resource "aws_route53_zone" "forkup" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "forkup.app"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>